{"data": "Anki Text File Import — Quick Reference\n\nWhat files and encoding\n- Plain text files (.txt). If you have other formats, save as plain text first.\n- UTF-8 encoding required.\n\nStructure and fields\n- Anki uses the first non-comment line to determine the number of fields.\n- If later records have fewer fields, missing fields are blank; extra fields are ignored.\n- Records are separated by the chosen field delimiter (comma, semicolon, tab, etc.). You can change the delimiter in import options or force it with headers.\n\nHeaders (top of the file)\n- You can add #key:value lines to control import:\n  - separator: , or ; or tab or space or | etc.\n  - html: true or false (treat as HTML)\n  - tags: space-separated tags added to every note\n  - columns: names of columns (for display)\n  - notetype: default note type (name or id)\n  - deck: default deck (name or id)\n  - notetype column: 1,2,3… (column containing per-row note type)\n  - deck column: 1,2,3… (column containing per-row deck)\n  - tags column: 1,2,3… (column containing per-row tags)\n  - guid column: 1,2,3… (column containing per-row GUID)\n\nMapping and notes\n- Fields in the text map to note fields; you can reassign mapping during import.\n- You can map a field to the tags field.\n\nDecks and duplicates\n- During import you choose which deck notes go to; if a template has a deck override, that deck may be used instead.\n- Duplicates: first field is used for uniqueness.\n  - If a matching note of the same type exists, you can update it or import as new (configurable).\n  - match scope determines duplicate checks: by note type only, or by note type and deck.\n  - If updating in place, existing scheduling remains.\n\nNotes on content and formatting\n- Quotes and multiline fields:\n  - Enclose field content in quotes to include newlines or separators.\n  - To include a literal quote inside a quoted field, double the quote: \"\".\n- HTML in fields:\n  - Enable Allow HTML in fields to use HTML formatting in text.\n  - If using HTML, you can replace special characters with HTML entities (< as &lt;, > as &gt;, & as &amp;).\n- HTML newlines in fields:\n  - Use <br> for a line break; ensure HTML is allowed.\n  - Escaped multiline may not work with cloze deletions spanning lines; prefer HTML line breaks in that case.\n- Including media references in text:\n  - Put media files in collection.media (no subfolders).\n  - Reference with <img src=\"filename.jpg\"> or [sound:filename.mp3].\n  - Use find/replace to convert placeholders to [sound:\\1.mp3] if needed (regex enabled).\n  - Enable Allow HTML for media markup to work.\n  - Do not embed media via templates (e.g., {{field}}) for this purpose.\n\nBulk media\n- The media import add-on can create notes from files in a folder (front = filename without extension; back = media).\n\nSpreadsheets and UTF-8\n- For non-Latin characters, save as UTF-8.\n- LibreOffice is recommended for UTF-8 CSV export (File > Save As > CSV). Excel exports can be problematic.\n\nNotes on GUIDs and updates\n- GUIDs are globally unique identifiers; if provided and already exist, duplicates are not created.\n- If you supply your own IDs, you can place them in the first field instead of the internal GUID.\n- When a GUID is present, the duplicate option may not apply as usual.\n\nSimple example\n- \"apple;banana;grape\"\n- Comment line: \"# this is ignored\"\n- field1;field2;field3\n\nQuick example with per-row note type and deck (via headers)\n- #separator:;\n- #notetype: Basic\n- #deck: MyDeck\n- apple; banana; grape\n\nSample with tags and HTML\n- notetype: Basic\n- deck: MyDeck\n- hello <b>world</b>; tag1 tag2; [sound:click.mp3]\n\nThis concise reference covers: file requirements, encoding, structure, headers, mapping, dealing with quotes and HTML, media handling, bulk media, duplicates, GUIDs, and a tiny example."}