{"data": "Twenty rules of formulating knowledge (concise)\n\n1) Do not learn if you do not understand. Comprehend first; avoid blind memorization.\n\n2) Learn before you memorize. Build an overall picture/structure before details.\n\n3) Build upon the basics. Start simple; expand later; basics are cheap and crucial.\n\n4) Stick to the minimum information principle. Keep items simple; split complex items into sub-items.\n\n5) Cloze deletion is easy and effective. Use gaps to create quick, repeatable recall; core of incremental reading.\n\n6) Use imagery. Visuals aid memory; weigh cost vs benefit; mind maps can help when appropriate.\n\n7) Use mnemonic techniques. Apply peg/mind-map methods; useful for 1–5% of items; train to use them automatically.\n\n8) Graphic deletion is as good as cloze deletion. Occlude parts of images to form multiple items.\n\n9) Avoid sets. Convert to enumerations or smaller units when possible; sets are hard to memorize.\n\n10) Avoid enumerations. If needed, use overlapping cloze deletions or groupings.\n\n11) Combat interference. Make items unambiguous; use context cues; review hard items; minimize confusion.\n\n12) Optimize wording. Be concise and precise; reduce wordiness to speed recall.\n\n13) Refer to other memories. Tie items to existing memories to reduce interference and improve context.\n\n14) Personalize and provide examples. Use personal, vivid examples to strengthen recall.\n\n15) Rely on emotional states. Pleasant/strongly labeled examples aid retrieval (use carefully).\n\n16) Context cues simplify wording. Use prefixes/labels (e.g., bioch:, math:) to set context and reduce ambiguity.\n\n17) Redundancy does not contradict minimum information principle. Redundant representations can help (multiple views, derivation steps).\n\n18) Provide sources. Attach sources to items for reliability; keep sources distinct from the learned content.\n\n19) Provide date stamping. Date/time stamps help manage volatile knowledge and updates.\n\n20) Prioritize. Manage sources, extraction, and formulation; use tools (Remember, Reschedule, Execute, Forget, Dismiss, Delete, Change forgetting index) to steer repetitions."}